[
  {
    "title": "Initiation à la programmation",
    "description": "Ce cours a pour but d’initier l’étudiant à la programmation orientée objet et le prépare au cours portant spécifiquement sur la programmation orientée objet",
    "imagePath": "assets/images/420-284-AH_b.png",  
    "code": "420-284-AH"
  },
  {
    "title": "Éléments d'infographie pour applications mobiles",
    "description": "Ce cours a pour objectif de développer des compétences liées à la conception, l’assemblage et la présentation de contenus multimédias pour les développeurs d’applications mobiles. Il prépare l’étudiant au cours portant sur la programmation Web côté client.",
    "imagePath": "assets/images/581-448-AH.png",  
    "code": "581-448-AH"
  },
  {
    "title": "Base de données",
    "description": "Ce cours a pour but d’initier l’étudiant à l’exploitation d’un système de gestion de bases de données",
    "imagePath": "assets/images/420-285-AH.png",  
    "code": "420-285-AH"
  },
  {
    "title": "Programmation orientée objet",
    "description": "Les objectifs intermédiaires de ce cours sont de schématiser un modèle objet à l’aide d’un diagramme de classes, de codifier un modèle d’objets en relations avancées à l’aide d’un langage de programmation orienté objet et de valider le fonctionnement d’une application.",
    "imagePath": "assets/images/420-286-AH.jpeg",  
    "code": "420-286-AH"
  },
  {
    "title": "Programmation Web côté client",
    "description": "Ce cours est le premier de deux cours portant sur le développement d’applications web. Il prépare donc l’étudiant aux apprentissages réalisés dans le cours de programmation Web coté serveur, qui lui fait suite.",
    "imagePath": "assets/images/420-287-AH_b.jpg",  
    "code": "420-287-AH"
  },
  {
    "title": "Développement d'applications Web progressives",
    "description": "Ce cours est le premier d’une série de quatre cours portant sur le développement d’applications mobiles sous Android. Il intègre les notions de programmation orientée objet déjà vue par l’étudiant et le prépare au cours portant sur le développement d’applications multiplateformes.",
    "imagePath": "assets/images/420-323-AH.png",  
    "code": "420-323-AH"
  },
  {
    "title": "Programmation Web côté serveur",
    "description": "Les objectifs intermédiaires sont de créer une page web HTML, d’utiliser des feuilles de style CSS, de programmer une application Web côté client à l’aide de Angular et de créer une application côté serveur en Node.js.",
    "imagePath": "assets/images/420-289-AH.png",  
    "code": "420-289-AH"
  },
  {
    "title": "Applications mobiles sous iOS 1",
    "description": "Effectuer le développement d’applications natives sans base de données",
    "imagePath": "assets/images/420-290-AH.jpg",  
    "code": "420-290-AH"
  },
  {
    "title": "Applications multiplateformes",
    "description": "Effectuer le développement d’applications multiplateforme avec base de données",
    "imagePath": "assets/images/420-324-AH.jpg",
    "code": "420-324-AH"
  }
]